[
  {
    "title": "Meta Quest 3S Is Bundled With $100 Amazon Gift Card For Cyber Monday - GameSpot",
    "description": "Amazon's Meta Quest 3S promotion is even better for Cyber Monday.",
    "url": "https://www.gamespot.com/articles/meta-quest-3s-is-bundled-with-100-amazon-gift-card-for-cyber-monday/1100-6528029/",
    "urlToImage": "https://www.gamespot.com/a/uploads/screen_kubrick/1595/15950357/4407634-metaquest3s.jpg",
    "content": "One of the best Black Friday gaming deals just got even better for Cyber Monday. The Meta Quest 3S now comes with a $100 digital Amazon gift card instead of $75. To get the $100 credit to applied to … [+1886 chars]"
  },
  {
    "title": "The Best Buy Cyber Monday Sale Is Live: The Best Deals on PlayStation 5, Gaming PCs, Laptops, and TVs - IGN",
    "description": "Best Buy has always been a tech and gaming focused retailer, perfect for our audience.",
    "url": "https://www.ign.com/articles/best-buy-cyber-monday-sales-and-deals-2024",
    "urlToImage": "https://assets-prd.ignimgs.com/2024/12/01/cmbestbuy-1733080287233.jpg?width=1280",
    "content": "Move over Black Friday, the Best Buy Cyber Monday Sale is now live! So far I've seen a mix of deals that include several that have been carried over from Black Friday as well as others that are exclu… [+9249 chars]"
  },
  {
    "title": "Marvel Rivals' next five characters have been confirmed - here's the list - Eurogamer",
    "description": "Marvel Rivals has confirmed five more characters are coming to the roster - Black Widow, Cloak and Dagger, Iron Fist, S…",
    "url": "https://www.eurogamer.net/marvel-rivals-next-five-characters-have-been-confirmed-heres-the-list",
    "urlToImage": "https://assetsio.gnwcdn.com/Screenshot-2024-12-01-at-17.37.56.png?width=1200&height=630&fit=crop&enable=upscale&auto=webp",
    "content": "Marvel Rivals has confirmed five more characters are coming to the roster - Black Widow, Cloak and Dagger, Iron Fist, Squirrel Girl, and Wolverine.\r\nThis brings the takes the full character count to … [+1566 chars]"
  },
  {
    "title": "I found the only iPhone 16 model on sale for one cent on Amazon ahead of Cyber Monday - ZDNet",
    "description": "It might be one of those 'too good to be true' offers for most people, but the right customer can realize the one-cent iPhone dream with this Boost Mobile promo. But grab it fast: this Cyber Monday deal won't be around for long.",
    "url": "https://www.zdnet.com/article/i-found-the-only-iphone-16-model-on-sale-for-one-cent-on-amazon-ahead-of-cyber-monday/",
    "urlToImage": "https://www.zdnet.com/a/img/resize/38c519bb00a22f84becbb715f4a54d485458434c/2024/09/24/fe5ec4b2-dd6e-45b7-9f9e-efc043ca5523/dsc02537.jpg?auto=webp&fit=crop&height=675&width=1200",
    "content": "Kerry Wan/ZDNET\r\nThe \"free phone\" deal is nothing new in the consumer space, and if you've clicked into this article with a bit of skepticism, that's normal. Such offers are almost always too good to… [+3486 chars]"
  },
  {
    "title": "Amazon Crushes the Price of the 2024 MacBook Air, Now at a Record Low for Cyber Monday - Gizmodo",
    "description": "The 2024 MacBook Air is heavily discounted for Cyber Monday.",
    "url": "https://gizmodo.com/amazon-crushes-the-price-of-the-2024-macbook-air-now-at-a-record-low-for-cyber-monday-2000532518",
    "urlToImage": "https://gizmodo.com/app/uploads/2024/11/2024-macbook-air.jpg",
    "content": "As Black Friday is now over, Amazon is moving to Cyber Monday with some great deals that Apple fans really wont want to miss. The 2024 13-inch MacBook Air 256GB is now available at an all-time low pr… [+2529 chars]"
  },
  {
    "title": "Google Maps is getting the last thing keeping you on Waze - Android Police",
    "description": "Incident reports from Waze on Google Maps",
    "url": "https://www.androidpolice.com/google-maps-waze-incident-reports/",
    "urlToImage": "https://static1.anpoimages.com/wordpress/wp-content/uploads/2024/05/google-maps-4-ap24-hero.jpg",
    "content": "Key Takeaways\r\n<ul><li> Google Maps now displays incident reports from the Waze community, showing alerts like \"Police reported ahead.\" </li><li> The bottom sheet with the report disappears after a w… [+2083 chars]"
  },
  {
    "title": "The Alienware Cyber Monday Sale at Dell Is Now Live: The Best Deals on Gaming Laptops & PCs - IGN",
    "description": "The biggest drops on gaming PCs, laptops, and monitors.",
    "url": "https://www.ign.com/articles/dell-alienware-cyber-monday-sale-2024-best-deals-on-gaming-laptops-gaming-pcs",
    "urlToImage": "https://assets-prd.ignimgs.com/2024/12/01/cmalienware-1733072274932.jpg?width=1280",
    "content": "If you're in the market for a prebuilt gaming PC for Cyber Monday, Alienware (which is owned by Dell) is one of best gaming brands we'd recommend. The Alienware Cyber Monday Sale has some great deals… [+9693 chars]"
  },
  {
    "title": "Forget Samsung Watches, This Apple Watch Ultra Is Slashed to Its All-Time Low Price for Cyber Monday - Gizmodo",
    "description": "Save over 15% on a #1 best-selling renewed Apple Watch Ultra fitness smartwatch for Black Friday at Amazon.",
    "url": "https://gizmodo.com/forget-samsung-watches-this-apple-watch-ultra-is-slashed-to-its-all-time-low-price-for-cyber-monday-2000532049",
    "urlToImage": "https://gizmodo.com/app/uploads/2024/11/AppleWatchUltra.jpg",
    "content": "Happy Black Friday weekend to all who celebrate huge savings. All throughout this weekend, expect to find great deals across home goods, electronics, and apparel from pretty much every online retaile… [+2237 chars]"
  }
]
